tako0910/py32f0-template/Libraries/PY32F032_LL_Driver/Inc/py32f032_ll_tim.h
/** @defgroup TIM_LL_EC_TIM1_TI3_RMP  TIM1 Timer Input Ch3 Remap
  * @{
  */
#define LL_TIM_TIM1_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 3 is connected to GPIO */
#define LL_TIM_TIM1_TI3_RMP_COMP1  TIM_TISEL_TI3SEL_0                                /*!< TIM1 input 3 is connected to COMP1_OUT */
#define LL_TIM_TIM1_TI3_RMP_COMP2  TIM_TISEL_TI3SEL_1                                /*!< TIM1 input 3 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM1_TI4_RMP  TIM1 Timer Input Ch4 Remap
  * @{
  */
#define LL_TIM_TIM1_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM1 input 4 is connected to GPIO */
#define LL_TIM_TIM1_TI4_RMP_COMP1  TIM_TISEL_TI4SEL_0                                /*!< TIM1 input 4 is connected to COMP1_OUT */
#define LL_TIM_TIM1_TI4_RMP_COMP2  TIM_TISEL_TI4SEL_1                                /*!< TIM1 input 4 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI1_RMP  TIM3 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM3_TI1_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 1 is connected to GPIO */
#define LL_TIM_TIM3_TI1_RMP_COMP1  TIM_TISEL_TI1SEL_0                                /*!< TIM3 input 1 is connected to COMP1_OUT */
#define LL_TIM_TIM3_TI1_RMP_COMP2  TIM_TISEL_TI1SEL_1                                /*!< TIM3 input 1 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI2_RMP  TIM3 Timer Input Ch2 Remap
  * @{
  */
#define LL_TIM_TIM3_TI2_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 2 is connected to GPIO */
#define LL_TIM_TIM3_TI2_RMP_COMP1  TIM_TISEL_TI2SEL_0                                /*!< TIM3 input 2 is connected to COMP1_OUT */
#define LL_TIM_TIM3_TI2_RMP_COMP2  TIM_TISEL_TI2SEL_1                                /*!< TIM3 input 2 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI3_RMP  TIM3 Timer Input Ch3 Remap
  * @{
  */
#define LL_TIM_TIM3_TI3_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 3 is connected to GPIO */
#define LL_TIM_TIM3_TI3_RMP_COMP1  TIM_TISEL_TI3SEL_0                                /*!< TIM3 input 3 is connected to COMP1_OUT */
#define LL_TIM_TIM3_TI3_RMP_COMP2  TIM_TISEL_TI3SEL_1                                /*!< TIM3 input 3 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM3_TI4_RMP  TIM3 Timer Input Ch4 Remap
  * @{
  */
#define LL_TIM_TIM3_TI4_RMP_GPIO   0x00000000U                                       /*!< TIM3 input 4 is connected to GPIO */
#define LL_TIM_TIM3_TI4_RMP_COMP1  TIM_TISEL_TI4SEL_0                                /*!< TIM3 input 4 is connected to COMP1_OUT */
#define LL_TIM_TIM3_TI4_RMP_COMP2  TIM_TISEL_TI4SEL_1                                /*!< TIM3 input 4 is connected to COMP2_OUT */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM15_TI1_RMP  TIM15 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM14_TI1_RMP_GPIO     0x00000000U                                       /*!< TIM14 input 1 is connected to GPIO */
#define LL_TIM_TIM14_TI1_RMP_RTC      TIM_TISEL_TI1SEL_0                                /*!< TIM14 input 1 is connected to RTC */
#define LL_TIM_TIM14_TI1_RMP_HSE_32   TIM_TISEL_TI1SEL_1                                /*!< TIM14 input 1 is connected to HSE/32 */
#define LL_TIM_TIM14_TI1_RMP_MCO      (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)         /*!< TIM14 input 1 is connected to MCO */
/**
  * @}
  */


/** @defgroup TIM_LL_EC_TIM16_TI1_RMP  TIM16 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM16_TI1_RMP_GPIO           0x00000000U                                     /*!< TIM16 input 1 is connected to GPIO */
#define LL_TIM_TIM16_TI1_RMP_MCO            TIM_TISEL_TI1SEL_1                              /*!< TIM16 input 1 is connected to MCO */
#define LL_TIM_TIM16_TI1_RMP_HSE_32         (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)       /*!< TIM16 input 1 is connected to HSE/32 */
#define LL_TIM_TIM16_TI1_RMP_RTC_WAKEUP     TIM_TISEL_TI1SEL_2                              /*!< TIM16 input 1 is connected to RTC */
#define LL_TIM_TIM16_TI1_RMP_LSE_CSS        (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)       /*!< TIM16 input 1 is connected to LSE CSS */
#define LL_TIM_TIM16_TI1_RMP_LSI            (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)       /*!< TIM16 input 1 is connected to LSI */
/**
  * @}
  */

/** @defgroup TIM_LL_EC_TIM17_TI1_RMP  TIM17 Timer Input Ch1 Remap
  * @{
  */
#define LL_TIM_TIM17_TI1_RMP_GPIO           0x00000000U                                     /*!< TIM17 input 1 is connected to GPIO */
#define LL_TIM_TIM17_TI1_RMP_MCO            (TIM_TISEL_TI1SEL_1)                             /*!< TIM17 input 1 is connected to MCO */
#define LL_TIM_TIM17_TI1_RMP_HSE_32         (TIM_TISEL_TI1SEL_1 | TIM_TISEL_TI1SEL_0)       /*!< TIM17 input 1 is connected to HSE/32 */
#define LL_TIM_TIM17_TI1_RMP_RTC_WAKEUP     (TIM_TISEL_TI1SEL_2)                            /*!< TIM17 input 1 is connected to RTC WAKEUP */
#define LL_TIM_TIM17_TI1_RMP_LSE_CSS        (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_0)       /*!< TIM17 input 1 is connected to LSE CSS */
#define LL_TIM_TIM17_TI1_RMP_LSI            (TIM_TISEL_TI1SEL_2 | TIM_TISEL_TI1SEL_1)       /*!< TIM17 input 1 is connected to LSI */


/**
  * @}
  */

/** @defgroup TIM_LL_EC_OCREF_CLR_INT OCREF clear input selection
  * @{
  */
#define LL_TIM_OCREF_CLR_INT_ETR           OCREF_CLEAR_SELECT_Msk       /*!< OCREF_CLR_INT is connected to ETRF */
#define LL_TIM_OCREF_CLR_INT_COMP1         0x00000000U                  /*!< OCREF clear input is connected to COMP1_OUT */
#define LL_TIM_OCREF_CLR_INT_COMP2         TIM_AF2_OCRSEL_0             /*!< OCREF clear input is connected to COMP2_OUT */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup TIM_LL_Exported_Macros TIM Exported Macros
  * @{
  */

/** @defgroup TIM_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */
/**
  * @brief  Write a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_TIM_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/**
  * @brief  Read a value in TIM register.
  * @param  __INSTANCE__ TIM Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_TIM_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)
/**
  * @}
  */

